; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 109171 2 3 3 6 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Star6 thermograph2)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Planet9 thermograph2)
))

)

; plan
1. (turn_to satellite1 star6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star6)
   goals met: 1 of 5
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 5
3. (turn_to satellite0 star6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
4. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 5
5. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 0 of 5
6. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 5
7. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 1 of 5
8. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 1 of 5
9. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 5
10. (take_image satellite0 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 5
11. (turn_to satellite1 star6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star6)
   goals met: 2 of 5
12. (turn_to satellite0 phenomenon7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 5
13. (take_image satellite0 phenomenon7 instrument2 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 3 of 5
14. (turn_to satellite0 star6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star6)
   goals met: 3 of 5
15. (take_image satellite0 star6 instrument2 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 4 of 5
16. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 4 of 5
17. (take_image satellite0 planet9 instrument2 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 5 of 5
